IdeaRS.OpenModel.CrossSection.CrossSectionFactory
CrossSectionFactory
CrossSectionFactory
CrossSectionFactory

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedZ(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Boolean)
Fill parameters for cold formed Z section
css: Parameters of CrossSectionParameter will be filled
Width: Css width
Height: Height of cross-section
Thickness: Thickness
Radius: Inside radius
Mirror: Mirrored shape
Remarks: Dimension of cold formed Z section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 6;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.15;
double Height = 0.20;
double Thickness = 0.003;
double Radius = 0.005;
bool Mirror = false;
CrossSectionFactory.FillColdFormedZ(css, Width, Height, Thickness, Radius, Mirror);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedZed(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean)
Fill parameters for cold formed Z-ed section
css: Parameters of CrossSectionParameter will be filled
Width: Css width
Height: Height of cross-section
Thickness: Thickness
Radius: Inside radius
Lip: Lip length
Mirror: Mirrored shape
Remarks: Dimension of cold formed Z-ed section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 7;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.15;
double Height = 0.20;
double Thickness = 0.004;
double Radius = 0.01;
double Lip = 0.02;
bool Mirror = false;
CrossSectionFactory.FillColdFormedZed(css, Width, Height, Thickness, Radius, Lip, Mirror);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedOmega(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double)
Fill parameters for cold formed Omega section
css: Parameters of CrossSectionParameter will be filled
Width: Css width
Height: Height of cross-section
FlangeWidth: Flange width
Thickness: Thickness
Radius: Inside radius
Remarks: Dimension of cold formed Omega section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 8;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.20;
double Height = 0.10;
double FlangeWidth = 0.10;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedOmega(css, Width, Height, FlangeWidth, Thickness, Radius);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedL(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
Fill parameters for cold formed L section
css: Parameters of CrossSectionParameter will be filled
Width: Horizontal leg length
Height: Vertical leg length
Thickness: Thickness
Radius: Inside radius
Remarks: Dimension of cold formed L section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 9;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.10;
double Height = 0.10;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedL(css, Width, Height, Thickness, Radius);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedLgen(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double)
Fill parameters for cold formed L - gen section
css: Parameters of CrossSectionParameter will be filled
Width: Horizontal leg length
Height: Vertical leg length
Angle: Angle between legs
Thickness: Thickness
Radius: Inside radius
Remarks: Dimension of cold formed L - gen section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 10;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.10;
double Height = 0.10;
double Angle = Math.PI / 2.0;
double Thickness = 0.003;
double Radius = 0.005;
CrossSectionFactory.FillColdFormedLgen(css, Width, Height, Angle, Thickness, Radius);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedRegularPolygon(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Int32,System.Double,System.Double)
Fill parameters for cold formed Regular polygon section
css: Parameters of CrossSectionParameter will be filled
Radius: Radius
Number: Number
Thickness: Thickness
InsideRadius: Inside radius
Remarks: Dimension of cold formed Regular polygon section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 11;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Radius = 0.10;
int Number = 8;
double Thickness = 0.003;
double InsideRadius = 0.005;
CrossSectionFactory.FillColdFormedRegularPolygon(css, Radius, Number, Thickness, InsideRadius);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedSigma(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Fill parameters for cold formed sigma section
css: Parameters of CrossSectionParameter will be filled
Height: Height
Width: Width
Lip: Length of lip
Thickness: Thickness
InsideRadius: Inside radius
HeightMiddle: Height of middle part
HeightEdge: Height of edge part
Depth: Depth of web-fold
Remarks: Dimension of cold formed sigma section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 12;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Height = 0.20;
double Width = 0.15;
double Lip = 0.02;
double Thickness = 0.005;
double InsideRadius = 0.010;
double HeightMiddle = 0.10;
double HeightEdge = 0.035;
double Depth = 0.035;
CrossSectionFactory.FillColdFormedSigma(css, Height, Width, Lip, Thickness, InsideRadius, HeightMiddle, HeightEdge, Depth);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillColdFormedRHS(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
Fill parameters for cold formed RHS section
css: Parameters of CrossSectionParameter will be filled
Height: Height
Width: Width
Thickness: Thickness
InsideRadius: Inside radius
Remarks: Dimension of cold formed RHS section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 13;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Height = 0.20;
double Width = 0.15;
double Thickness = 0.005;
double InsideRadius = 0.010;
CrossSectionFactory.FillColdFormedRHS(css, Width, Height, Thickness, InsideRadius);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWeldedI(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
Fill steel section of welded I
css: Parameters of CrossSectionParameter will be filled
bu: Width of flange
hw: Height of web
tw: Web thickness
tf: Flange thickness
Remarks: Dimension of welded I section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 1;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());  // I have only one material, I take the first one
double bu = 0.2;
double hw = 0.4;
double tw = 0.025;
double tf = 0.02;
CrossSectionFactory.FillWeldedI(css, bu, hw, tw, tf);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWeldedT(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
Fill steel section of welded T
css: Parameters of CrossSectionParameter will be filled
b: Width of flange
h: Height of web
tw: Web thickness
tf: Flange thickness
Remarks: Dimension of welded T section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 2;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double b = 0.2;
double h = 0.4;
double tw = 0.02;
double tf = 0.35;
CrossSectionFactory.FillWeldedT(css, b, h, tw, tf);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWeldedU(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Fill steel section of channel shape
cssO: Parameters of CrossSectionParameter will be filled
b: width
hw: depth
tw: web thickness
tf: flange thickness
rw: root radius
rf: flange edge rounding radius
taperF: Flange taper
Returns:
Remarks: Dimension of channel section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 3;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double b = 0.2;
double hw = 0.4;
double tw = 0.025;
double tf= 0.02;
double rw= 0.004;
double rf = 0.002;
double taperF = 0.001;
CrossSectionFactory.FillWeldedU(css, b, hw, tw, tf, rw, rf, taperF);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssSteelAngle(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean)
Fill steel section of angle shape
css: Parameters of CrossSectionParameter will be filled
B: width
D: depth
t: thickness
rw: root radius
r2: toe radius
C: centroid position
mirrorZ: profile can be mirrored
Returns:
Remarks: Dimension of angle section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 4;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double B = 0.2;
double D = 0.4;
double t = 0.025;
double rw = 0.004;
double r2 = 0.002;
double C = 0.0;
bool mirrorZ = false;
CrossSectionFactory.FillCssSteelAngle(css, B, D, t, rw, r2, C, mirrorZ);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssIarc(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Fill steel section of parametric I section
css: Parameters of CrossSectionParameter will be filled
cssGeomB: Css width
cssGeomH: Height of cross-section
cssGeomS: Web thickness
cssGeomT: Flange thickness
cssGeomR2: inside radius
tapperF: Flange tapper
r1: Flange edge rounding radius
Returns:
Remarks: Dimension of parametric I section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 8;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double cssGeomB = 0.25;
double cssGeomH = 0.45;
double cssGeomS = 0.02;
double cssGeomT = 0.03;
double cssGeomR2 = 0.012;
double tapperF = Math.PI / 180.0 * 5.0;
double r1 = 0.015;
CrossSectionFactory.FillCssIarc(css, cssGeomB, cssGeomH, cssGeomS, cssGeomT, cssGeomR2, tapperF, r1);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssTarc(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates one item cross-section T - steel shape
css: Parameters of CrossSectionParameter will be filled
cssGeomB: Css width
cssGeomH: Height of cross-section
cssGeomTw: Web thickness
cssGeomTf: Flange thickness
cssGeomR: Inside radius
cssGeomR1: Flange edge rounding radius
cssGeomR2: Web edge rounding radius
tapperF: Flange tapper
tapperW: Web tapper
Returns:
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 9;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double cssGeomB = 0.25;
double cssGeomH = 0.30;
double cssGeomTw = 0.02;
double cssGeomTf = 0.03;
double cssGeomR = 0.015;
double cssGeomR1 = 0.008;
double cssGeomR2 = 0.0010;
double tapperF = Math.PI / 180.0 * 5.0;
double tapperW = Math.PI / 180.0 * 7.0;
CrossSectionFactory.FillCssTarc(css, cssGeomB, cssGeomH, cssGeomTw, cssGeomTf, cssGeomR, cssGeomR1, cssGeomR2, tapperF, tapperW);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillWeldedAsymI(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Welded I asymetrical - steel shape
css: Parameters of CrossSectionParameter will be filled
bu: Width of upper flange
bb: Width of bottom flange
hw: Height of web
tw: Web thickness
tfu: Upper flange thickness
tfb: Bottom flange thickness
Remarks: Dimension of assymetrical I section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 4;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double bu = 0.150;
double bb = 0.180;
double hw = 0.320;
double tw = 0.016;
double tfu = 0.014;
double tfb = 0.018;
CrossSectionFactory.FillWeldedAsymI(css, bu, bb, hw, tw, tfu, tfb);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeDblU(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a ][ steel shape of css.
css: Parameters of CrossSectionParameter will be filled
bt: The width of U top flange.
bb: The width of U bottom flange.
h: The height of U shape.
tb: The bottom deck thickness.
tl: The left deck thickness.
tr: The right deck thickness.
dis: Distance between ][
Remarks: Dimension of assymetrical I section
This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 5;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double bt = 0.150;
double bb = 0.180;
double h = 0.320;
double tb = 0.016;
double tfu = 0.014;
double tfb = 0.018;
double dis= 0.025;
CrossSectionFactory.FillShapeDblU(css, bt, bb, h, tb, tl, tr, dis);
openStructModel.AddObject(css);

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillBox2(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Box 2 - steel shape
css: Parameters of CrossSectionParameter will be filled
bu: Width of upper flange
bb: Width of bottom flange
hw: Height of web
b1: Web distance
tw: Web thickness
tfu: Upper flange thickness
tfb: Bottom flange thickness

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCHSPar(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double)
Circular hollow section  - steel shape
css: Parameters of CrossSectionParameter will be filled
D: Diameter
t: thickness

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCssSteelChannel(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Create steel section Channel shape - steel shape
css: Parameters of CrossSectionParameter will be filled
B: width
D: depth
tw: web thickness
tf: flange thickness
rw: root radius
rf: flange edge rounding radius
taperF: Flange taper
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillOHollow(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double)
Fill massive pipe steel shape
cssO: Parameters of CrossSectionParameter will be filled
r: The radius of circle.
t: The thickness of wall.
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillSteelTube(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double)
Fill steel tube
cssO: Parameters of CrossSectionParameter will be filled
r: The radius of circle.
t: The thickness of wall.
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillRectangle(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double)
Rectangle shape - massive concrete shape
css: Parameters of CrossSectionParameter will be filled
width: Width of the rectangle
height: Height of the rectangle
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillCircle(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double)
Circular shape - massive concrete shape
css: Parameters of CrossSectionParameter will be filled
d: Diametrer of the shape
Returns:

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeI(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
I shape - massive concrete shape
css: Parameters of CrossSectionParameter will be filled
h: Total height
btf: Width of the upper part
bbf: Width of the bottom part
htf: Thickness of the upper part
hbf: Thickness of the bottom  part
tw: Thinkness of the web

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeL(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
Creates a new L shape css - massive concrete shape
css: Parameters of CrossSectionParameter will be filled
h: The height of css.
b: The width of css.
th: The bottom flange thisckness.
sh: The wall thickness.

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeDblL(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a new L shape css
css: Parameters of CrossSectionParameter will be filled
h: The height of css.
b: The width of css.
th: The bottom flange thisckness.
sh: The wall thickness.
dis: Distance between _||_

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeDblLu(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double,System.Double)
Creates a new L shape css.
css: Parameters of CrossSectionParameter will be filled
h: The height of css.
b: The width of css.
th: The bottom flange thisckness.
sh: The wall thickness.
dis: Distance between _||_

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeT(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
T shape  - massive concrete shape
css: Parameters of CrossSectionParameter will be filled
b: Width of shape
h: Height of shape
hf: Top flange width
bw: Wall width

IdeaRS.OpenModel.CrossSection.CrossSectionFactory.FillShapeTrev(IdeaRS.OpenModel.CrossSection.CrossSectionParameter,System.Double,System.Double,System.Double,System.Double)
T turned shape - massive concrete shape
css: Parameters of CrossSectionParameter will be filled
b: Width of shape
h: Height of shape
hf: Top flange width
bw: Wall width